{
  "photo": "assets/photo-min.png",
  "name": "Alex Bushmanov",
  "summary": "Dedicated and passionate <b>Frontend Developer</b> with <b>8 years</b> of hands-on <b>experience</b> in crafting visually stunning, high-performance, and user-friendly web applications. Adept in JavaScript, with a strong command of modern frameworks and libraries such as React, Angular, and Vue.js. Proven ability to collaborate effectively with cross-functional teams, consistently delivering innovative and scalable solutions that exceed client expectations. Committed to staying up-to-date with the latest industry trends and best practices to drive continuous improvement and growth.",
  "skills": [
    {
      "name": "Typescript",
      "level": 100,
      "emoji": "🏎"
    },
    {
      "name": "JavaScript",
      "level": 100,
      "emoji": "🚲"
    },
    {
      "name": "Node",
      "level": 100,
      "emoji": "🤖"
    },
    {
      "name": "React",
      "level": 100,
      "emoji": "🧪"
    },
    {
      "name": "AWS",
      "level": 90,
      "emoji": "☁"
    },
    {
      "name": "Developer Relations",
      "level": 90,
      "emoji": "📢"
    },
    {
      "name": "Git",
      "level": 100,
      "emoji": "💬"
    },
    {
      "name": "NextJS",
      "level": 100,
      "emoji": "🛳"
    },
    {
      "name": "SCSS",
      "level": 100,
      "emoji": "💅"
    },
    {
      "name": "Figma",
      "level": 80,
      "emoji": "🏖"
    },
    {
      "name": "GraphQL",
      "level": 100,
      "emoji": "🐙"
    },
    {
      "name": "ZEIT Now",
      "level": 80,
      "emoji": "🚜"
    },
    {
      "name": "Algolia",
      "level": 50,
      "emoji": "🔍"
    },
    {
      "name": "jQuery",
      "level": 100,
      "emoji": "🧟"
    },
    {
      "name": "Jade",
      "level": 80,
      "emoji": "🪚"
    },
    {
      "name": "HTML",
      "level": 100,
      "emoji": "🪵"
    },
    {
      "name": "Websockets",
      "level": 100,
      "emoji": "🔃"
    },
    {
      "name": "Vue 2",
      "level": 80,
      "emoji": "🛸"
    },
    {
      "name": "Project Management",
      "level": 70,
      "emoji": "♥"
    },
    {
      "name": "prismic.io",
      "level": 100,
      "emoji": "🤓"
    },
    {
      "name": "GatsbyJS",
      "level": 70,
      "emoji": "🍸"
    },
    {
      "name": "mongoDB",
      "level": 80,
      "emoji": "🍃"
    },
    {
      "name": "canvas",
      "level": 100,
      "emoji": "🖌"
    },
    {
      "name": "SVG",
      "level": 100,
      "emoji": "📐"
    },
    {
      "name": "threeJS",
      "level": 50,
      "emoji": "🎮"
    },
    {
      "name": "webGL",
      "level": 50,
      "emoji": "🔮"
    },
    {
      "name": "Redis",
      "level": 30,
      "emoji": "🥕"
    },
    {
      "name": "KnockoutJS",
      "level": 100,
      "emoji": "🥊"
    },
    {
      "name": "koaJS",
      "level": 90,
      "emoji": "🐨"
    }
  ],
  "experiences": [
    {
      "company": "Space307",
      "position": "Senior Software Engineer / Tech Team",
      "country": "Cyprus",
      "dates": "Aug 2021 - Feb 2023",
      "description": "During my time at Space307, I optimized global product development by improving development processes, contributing to code reviews, and using AWS to create a global topology caching and distribution system. Additionally, I developed and improved product features, wrote technical documentation to ensure team members could easily understand and use products and features, and mentored colleagues to achieve their professional goals and four aspiring web developers from Russia and Ukraine. My efforts supported the company's success and maintained high development standards. Lastly, utilizing my journalism background, I wrote articles promoting the HR brand and managed a channel on front-end news for senior developers with over 1,000 subscribers.",
      "skills": [
        "Typescript",
        "JavaScript",
        "ReactJS",
        "Developer Relations",
        "Figma",
        "Git",
        "AWS",
        "React",
        "SCSS",
        "jQuery",
        "HTML",
        "Websockets",
        "NodeJS",
        "GatsbyJS",
        "mongoDB",
        "canvas",
        "SVG",
        "webGL"
      ]
    },
    {
      "company": "KMS Lighthouse",
      "position": "Senior Software Engineer / Team Leader",
      "country": "Russia",
      "dates": "Nov 2020 - Jun 2021",
      "description": "At KMS Lighthouse, I was responsible for developing new product features while managing a team of front-end and back-end developers. In addition, I took charge of improving communication processes within and between teams and with the business. I also played a key role in providing support for legacy code, ensuring that it was maintained and updated as needed. By doing so, I was able to ensure that the company's products were of the highest quality and met the needs of both the customers and the stakeholders.",
      "skills": [
        "Figma",
        "Git",
        "React",
        "Typescript",
        "SCS",
        "Project Management",
        "Jira"
      ]
    },
    {
      "company": "Distillery",
      "position": "Senior Software Engineer / Team Leader",
      "country": "Russia",
      "dates": "Feb 2019 - Nov 2020",
      "description": "At Distillery, I was a team leader responsible for migrating clients' websites to new technology stacks. In this role, I led a development team that included front-end, back-end, QA, and manager roles. Additionally, I was responsible for improving the functionality of the company's internal tools, ensuring that they were up-to-date and effective. Through my work, I was able to create a positive impact on the company's clients, as well as on the company's employees. Furthermore, I conducted interviews for Frontend Engineers in both Russian and English, which allowed me to find and attract top talent from around the world. Overall, I played an instrumental role in improving the company's technical capabilities and strengthening its position in the market.",
      "skills": [
        "Git",
        "React",
        "NextJS",
        "Typescript",
        "SCSS",
        "styled-components",
        "GraphQL",
        "ZEIT Now",
        "Algolia",
        "CSS",
        "HTML",
        "Websockets",
        "Зкщоусе Ьфтфпуьуте",
        "JavaScript",
        "ReactJS",
        "NodeJS",
        "NextJs",
        "prismic.io",
        "GatsbyJS",
        "mongoDB",
        "SVG",
        "Redis",
        "WebRTC"
      ]
    },
    {
      "company": "EXEC LOGIC ",
      "position": "Full Stack Developer",
      "country": "Russia",
      "dates": "Jun 2016 - Dec 2018",
      "description": "During my work, I was tasked with creating a large application with the primary goal of constructing a roof using a variety of materials. To accomplish this, I utilized both client and server-side technologies. The application allowed users to create new materials or use existing ones, generate roof drawings, calculate the required quantity and cost of materials, and even place an order. By implementing these features, I was able to provide users with a comprehensive solution that helped them build their ideal roofs while also making the process more efficient and cost-effective.",
      "skills": [
        "Git",
        "CSS",
        "HTML",
        "Websockets",
        "JavaScript",
        "NodeJS",
        "mongoDB",
        "canvas",
        "SVG",
        "webGL",
        "KnockoutJS"
      ]
    },
    {
      "company": "AdWatch Isobar",
      "position": "Software Engineer",
      "country": "Russia",
      "dates": "Jul 2014 - Nov 2015",
      "description": "As part of my daily work, I was responsible for breathing life into a designer's vision by using HTML, CSS, and JavaScript to implement responsive design for mobile sites. I was also tasked with reviewing pull requests from other developers and testers, and performing refactoring to improve the codebase. Additionally, I evaluated projects and planned tasks to ensure that all work was completed efficiently and effectively. Despite the challenges that came with the job, I remained dedicated and committed to delivering the best possible results, ultimately contributing to the success of the projects I was involved in.",
      "skills": [
        "Git",
        "SCSS",
        "jQuery",
        "Jade",
        "LESS",
        "CSS",
        "HTML",
        "JavaScript",
        "canvas",
        "SVG"
      ]
    },
    {
      "company": "Self-Employed",
      "position": "Frontend Developer",
      "country": "Russia",
      "dates": "Jan 2012 - Jun 2014",
      "description": "In 2012, I graduated from university, having worked as a photographer, journalist, and print advertising specialist during my studies. After graduation, I continued to work as an interior photographer while also beginning to study C++ as I was eager to explore programming. After a few months, I unexpectedly received an opportunity to complete someone else's project - a simple static site for a company dealing with patents. This is where I first encountered HTML and began to delve into the world of web development.\n\nOver the next two years, I focused on mastering HTML, CSS, and vanilla Javascript as I worked remotely and searched for orders on freelancer websites. By the beginning of 2013, I had secured a large permanent customer from Moscow, with whom I worked exclusively for some time. However, in 2014, I decided to seek out a position in a larger company where I could work alongside more experienced developers and expand my knowledge further. Despite the challenges and setbacks that inevitably arise in any field, I remained committed to my passion for programming, constantly striving to improve my skills and deliver the best possible results.",
      "skills": [
        "Git",
        "CSS",
        "HTML",
        "webGL"
      ]
    }
  ],
  "contacts" : {
    "Tel": "+995-595-00-2584",
    "Email": "4lex.bu@gmail.com",
    "Telegram": "https://t.me/bushizzle",
    "LinkedIn": "https://www.linkedin.com/in/a-bu/",
    "GitHub": "https://github.com/Bushizzle",
    "Facebook": "https://www.facebook.com/profile.php?id=100008326755935"
  }
}